CSI API ETABS v1
cPropTendon.GetProp Method
 Retrieves tendon property definition data.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetProp(
	string Name,
	ref string MatProp,
	ref int ModelingOption,
	ref double Area,
	ref int Color,
	ref string Notes,
	ref string GUID
)
Function GetProp (
	Name As String,
	ByRef MatProp As String,
	ByRef ModelingOption As Integer,
	ByRef Area As Double,
	ByRef Color As Integer,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropTendon
Dim Name As String
Dim MatProp As String
Dim ModelingOption As Integer
Dim Area As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetProp(Name, MatProp,
	ModelingOption, Area, Color, Notes,
	GUID)
int GetProp(
	String^ Name,
	String^% MatProp,
	int% ModelingOption,
	double% Area,
	int% Color,
	String^% Notes,
	String^% GUID
)
abstract GetProp :
        Name : string *
        MatProp : string byref *
        ModelingOption : int byref *
        Area : float byref *
        Color : int byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing tendon property.
MatProp
Type: System.String
The name of the material property assigned to the tendon property.
ModelingOption
Type: System.Int32
This is either 1 or 2, indicating the tendon modeling option.
Value | Modeling Option
1 | Model tendon as loads
2 | Model tendon as elements
Area
Type: System.Double
The cross-sectional area of the tendon. [L2]
Color
Type: System.Int32
Notes
Type: System.String
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the property.
Return Value
Type: Int32
Returns zero if the property is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Modeling tendons as elements (ModelingOption = 2) is not supported in ETABS.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim MatProp As String
       Dim ModelingOption As Integer
       Dim Area As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add tendon material
       ret = SapModel.PropMaterial.AddQuick(Name, eMatType.Tendon, , , , , , eMatTypeTendon.ASTM_A416Gr270)
   'set new tendon property
       ret = SapModel.PropTendon.SetProp("T1", Name, 1, 2.25)
   'get tendon property data
       ret = SapModel.PropTendon.GetProp("T1", MatProp, ModelingOption, Area, Color, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropTendon Interface
ETABSv1 Namespace